poloten4ik100/spsvi/STM32L/main.cpp
if (sign < 0)
s[i++] = '-';
s[i] = '\0';
reverse(s);
}

//arduino example code for getting the calibrated magnetometer data 
//calibrated_values[3] is the global array where the calibrated data will be placed
//calibrated_values[3]: [0]=Xc, [1]=Yc, [2]=Zc
float calibrated_values[3];   
//transformation(float uncalibrated_values[3]) is the function of the magnetometer data correction 
//uncalibrated_values[3] is the array of the non calibrated magnetometer data
//uncalibrated_values[3]: [0]=Xnc, [1]=Ync, [2]=Znc
void transformation(float uncalibrated_values[3])    
{
  //calibration_matrix[3][3] is the transformation matrix
  //replace M11, M12,..,M33 with your transformation matrix data
  double calibration_matrix[3][3] = 
  {
    {1.038, -0.009, 0.011},
    {0.021, 1.065, -0.046},
    {0.027, 0.019, 1.241}  
  };
  //bias[3] is the bias
  //replace Bx, By, Bz with your bias data
  double bias[3] = 
  {
    15.67,
    14.585,
    -33.419
  };  
  //calculation
  for (int i=0; i<3; ++i) uncalibrated_values[i] = uncalibrated_values[i] - bias[i];
  float result[3] = {0, 0, 0};
  for (int i=0; i<3; ++i)
    for (int j=0; j<3; ++j)
      result[i] += calibration_matrix[i][j] * uncalibrated_values[j];
  for (int i=0; i<3; ++i) calibrated_values[i] = result[i];
}
// Характериски привода ухудшают 
main()
{
  char str[10]; 
  double servo_angle_pitch_integral = 90;
  double servo_angle_pitch_pre = 0;
  double servo_res_pitch = 0;
  double servo_res_roll = 0;
  double pitch;
  double roll;
  double pitch_tmp;
  double roll_tmp;
  double yaw;
  double FilterRoll;
  double FilterPitch;
  double FilterYaw;
  double tmp1 = 0;
  double tmp2 = 0;
  double zaderzhka = 10; //мс 10^-3 c
  double K = 0.04;
  double angle;
  double Xcal2;  
  double Ycal2;
  double xa,ya,za;
  int f=0;
  
  double PKp = 0.4; //0.4
  double PKi = 0.0006; //0.0006
  double PKd = 0.008; //0.005
  double RKp = 0.35; //0.4
  double RKi = 0.0006; //0.0006
  double RKd = 0.008; //0.005
  double error_pitch = 0;
  double pre_error_pitch = 0;
  double integral_pitch = 0;
  double error_roll = 0;
  double pre_error_roll = 0;
  double integral_roll = 0;
  
  /* 
  Настраиваем такирвую частоту процессора от HSI 
  HSI oscillator clock – внутренний высокочастотный RC генератор
  с частотой 16 МГц 
  */
  RCC->CR |= RCC_CR_HSION; //Включаем тактовый генератор HSI
  while(!(RCC_CR_HSIRDY)); //Ждем его стабилизации
  RCC->CFGR |= RCC_CFGR_SW_HSI; //Выбираем источником тактовой частоты SYSCLK генератор HSI
  RCC->CR &= ~RCC_CR_MSION; //Отключаем генератор MSI.
  
  InitUSART(); 
  SERVO();  
  InitI2C();  
  Init_L3G4200D();
  Init_ADXL345();
  Init_MC5883L();
  Delay_ms(1);
  
  while(1)
  {
    //Usart_Transmit(I2C_single_read(ADXL345_Address_w,ADXL345_Address_r,0x00));
 /*   if (f==30){f=0;set_pos_servo1(180);}
    else
    {f++;
    if (f==15) set_pos_servo1(0);
    }*/
    getAccelValues();
    getGyroValues();
    getMagValues();
    
    xa =x_a*0.03125; 
    ya =y_a*0.03125;
    za =z_a*0.03125;
    roll_tmp = atan2(ya ,za);
    pitch_tmp = atan2(xa ,sqrt(za*za + ya*ya));
    roll = (atan2(ya ,za) * 180) / 3.14;
    pitch = (atan2(xa ,sqrt(za*za + ya*ya)) * 180) / 3.14;
    FilterRoll = (1-K)*(FilterRoll+x_g*0.07*(zaderzhka/1000))+K*roll;
    FilterPitch = (1-K)*(FilterPitch+(-1)*y_g*0.07*(zaderzhka/1000))+K*pitch;
    roll_angle = (-1)*FilterRoll+90;
    pitch_angle = FilterPitch+90;  
    
    //set_pos_servo1();
    //servo_angle_pitch_integral+=(-1)*(pitch_angle-90)*0.1*10;
    //servo_angle_pitch = servo_angle_pitch_integral + (-1)*(pitch_angle-90)*0;
    //servo_angle_pitch=90-(pitch_angle-90);
    //servo_angle_pitch +=Kp*(0-(pitch_angle-90));
    
    
    error_pitch = (0-(pitch_angle-90));
    if (0 < servo_res_pitch < 180){
      integral_pitch = integral_pitch + error_pitch;
    }
    servo_res_pitch += PKp*error_pitch + PKi*integral_pitch*(zaderzhka/1000)+PKd*(error_pitch - pre_error_pitch)/(zaderzhka/1000);   
    set_pos_servo1(servo_res_pitch);
    pre_error_pitch = error_pitch;
    // set_pos_servo2(90);
   
    error_roll = (0-(roll_angle-90));
    if (0 < servo_res_roll < 180){
      integral_roll = integral_roll + error_roll;
    }
    servo_res_roll += RKp*error_roll + RKi*integral_roll*(zaderzhka/1000)+RKd*(error_roll - pre_error_roll)/(zaderzhka/1000);   
    set_pos_servo2(servo_res_roll);
    pre_error_roll = error_roll;
/*
    // не используем
 if (roll_angle>90)
    {
      servo_angle_roll++;
      set_pos_servo2(servo_angle_roll);
      //Delay_ms(20);
    } else 
    {
      if (roll_angle<90)
      {
        servo_angle_roll--;
        set_pos_servo2(servo_angle_roll);
        //Delay_ms(20);
      }
    }     */   
   
  /* if (pitch_angle>90)
    {
     // tmp1 = pitch_angle - 90;
      servo_angle_pitch--;// servo_angle_pitch - tmp1;
      set_pos_servo1(servo_angle_pitch);
      //Delay_ms(20);
    } else 
    {
      if (pitch_angle<90)
      {
        //tmp2 =  90 + pitch_angle;
        servo_angle_pitch++;//= servo_angle_pitch + tmp2;
        
        set_pos_servo1(servo_angle_pitch);
        //Delay_ms(20);
      }
    }   */ 
  // sprintf(str, "%d", servo_angle_pitch);
  //  Usart_Transmit_str(str); 
    /*
     Usart_Transmit(servo_res_pitch);
    Usart_Transmit(roll_angle);
    Usart_Transmit(roll+90);
    Usart_Transmit(error_pitch);*/
 //   Usart_Transmit('z');*/
     //Usart_Transmit_str("\r\n");
    //sprintf(str, "%f", y_g*0.07 ); 
     //Usart_Transmit_str(str);
    //Usart_Transmit(xg_2);
     //Usart_Transmit_str("\r\n");
  /*  float input_data [3] = {(double)x_m,(double)y_m,(double)z_m};
    transformation(input_data);     
    Xcal2 = ((int)calibrated_values[0]*0.92)*cos((float)pitch_tmp) + ((int)calibrated_values[1]*0.92)*sin((float)roll_tmp)*sin((float)pitch_tmp) + ((int)calibrated_values[2]*0.92)*cos((float)roll_tmp)*sin((float)pitch_tmp);
    Ycal2 = ((int)calibrated_values[1]*0.92)*cos((float)roll_tmp) - ((int)calibrated_values[2]*0.92)*sin((float)roll_tmp);
    angle = atan2( -Ycal2, Xcal2 );
    if (angle < 0) 
    angle += 2*3.14;
    if (angle > 2*3.14)
    angle -= 2*3.14;        
    yaw = (uint16_t)(angle * (180 / 3.14));
    FilterYaw = (1-K)*(FilterYaw+z_g*0.07*(zaderzhka/1000))+K*yaw; 

    if (FilterYaw>180)
    {
      servo_angle_yaw--;
      set_pos_servo3(servo_angle_yaw); 
    } else 
    {
      if (FilterYaw<180)
      {
        servo_angle_yaw++;
        set_pos_servo3(servo_angle_yaw);
      }
    } */
    /*sprintf(str, "%d", FilterYaw ); 
      Usart_Transmit_str(str); 
      Usart_Transmit_str("\r\n");*/
    /*
    // Вывод калиброваных значений
    float input_data [3] = {(double)x_m,(double)y_m,(double)z_m};
    transformation(input_data);
    sprintf(str, "%d ", (int)calibrated_values[0]);
    Usart_Transmit_str(str);
    Usart_Transmit(',');
    sprintf(str, "%d", (int)calibrated_values[1]);
    Usart_Transmit_str(str);
    Usart_Transmit(',');
    sprintf(str, "%d", (int)calibrated_values[2]);
    Usart_Transmit_str(str);
    Usart_Transmit_str("\r\n");*/
    Delay_ms(zaderzhka);
    //Отладка в матлабе
    /*Usart_Transmit(xa_1);
    Usart_Transmit(xa_2);
    Usart_Transmit(ya_1);
    Usart_Transmit(ya_2);
    Usart_Transmit(za_1);
    Usart_Transmit(za_2);
    
    Usart_Transmit(xg_1);  
    Usart_Transmit(xg_2);
    Usart_Transmit(yg_1);  
    Usart_Transmit(yg_2);
    Usart_Transmit(zg_1);  
    Usart_Transmit(zg_2);
   
    Usart_Transmit(xm_1);  
    Usart_Transmit(xm_2);
    Usart_Transmit(ym_1);  
    Usart_Transmit(ym_2);
    Usart_Transmit(zm_1); 
    Usart_Transmit(zm_2);
    uint8_t data;
    l=0;
    while(!(l==1))
    {
      while(!USART_GetFlagStatus(USART1,USART_FLAG_RXNE)==RESET)
      {
      data=USART_ReceiveData(USART1);
      if (data==0x0D) l=1;
      }
    }*/
  /*  int i=0;
   for (i=0;i<180;i++)
   {
     Delay_ms(100);
     set_pos_servo3(i);
   }*/
  }

}
